{"class_name": "Tokenizer", "config": {"num_words": 500, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 159, "word_counts": "{\"events\": 42, \"today\": 21, \"what\": 17, \"show\": 7, \"me\": 9, \"any\": 2, \"for\": 10, \"schedule\": 4, \"on\": 4, \"are\": 1, \"happening\": 5, \"scheduled\": 1, \"is\": 4, \"activities\": 4, \"right\": 1, \"now\": 2, \"current\": 1, \"this\": 16, \"week\": 35, \"weekly\": 2, \"in\": 2, \"the\": 7, \"next\": 16, \"days\": 1, \"upcoming\": 4, \"coming\": 3, \"future\": 1, \"following\": 1, \"planned\": 1, \"event\": 25, \"details\": 7, \"tell\": 4, \"about\": 12, \"of\": 7, \"info\": 6, \"give\": 1, \"describe\": 3, \"more\": 4, \"information\": 4, \"explain\": 1, \"description\": 2, \"full\": 1, \"venue\": 5, \"where\": 7, \"location\": 9, \"find\": 2, \"place\": 6, \"address\": 2, \"will\": 1, \"it\": 2, \"be\": 1, \"does\": 1, \"take\": 1, \"help\": 3, \"can\": 2, \"you\": 4, \"do\": 4, \"don\": 1, \"understand\": 1, \"hello\": 3, \"hi\": 3, \"hey\": 3, \"greetings\": 1, \"good\": 4, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"assist\": 2, \"how\": 2, \"commands\": 1, \"options\": 1, \"menu\": 1, \"start\": 1, \"begin\": 1, \"support\": 2, \"guide\": 1, \"to\": 1, \"use\": 1, \"instructions\": 1, \"please\": 2, \"todays\": 1, \"weeks\": 2, \"there\": 2, \"bot\": 1, \"day\": 1}", "word_docs": "{\"events\": 42, \"today\": 21, \"what\": 17, \"show\": 7, \"me\": 9, \"any\": 2, \"for\": 10, \"schedule\": 4, \"on\": 4, \"are\": 1, \"happening\": 5, \"scheduled\": 1, \"is\": 4, \"activities\": 4, \"right\": 1, \"now\": 2, \"current\": 1, \"this\": 16, \"week\": 35, \"weekly\": 2, \"in\": 2, \"days\": 1, \"the\": 7, \"next\": 16, \"upcoming\": 4, \"coming\": 3, \"future\": 1, \"following\": 1, \"planned\": 1, \"details\": 7, \"event\": 25, \"about\": 12, \"tell\": 4, \"of\": 7, \"info\": 6, \"give\": 1, \"describe\": 3, \"more\": 4, \"information\": 4, \"explain\": 1, \"description\": 2, \"full\": 1, \"venue\": 5, \"where\": 7, \"location\": 9, \"find\": 2, \"place\": 6, \"address\": 2, \"will\": 1, \"it\": 2, \"be\": 1, \"does\": 1, \"take\": 1, \"help\": 3, \"you\": 4, \"can\": 2, \"do\": 3, \"don\": 1, \"understand\": 1, \"hello\": 3, \"hi\": 3, \"hey\": 3, \"greetings\": 1, \"morning\": 1, \"good\": 4, \"afternoon\": 1, \"evening\": 1, \"assist\": 2, \"how\": 2, \"commands\": 1, \"options\": 1, \"menu\": 1, \"start\": 1, \"begin\": 1, \"support\": 2, \"guide\": 1, \"use\": 1, \"to\": 1, \"instructions\": 1, \"please\": 2, \"todays\": 1, \"weeks\": 2, \"there\": 2, \"bot\": 1, \"day\": 1}", "index_docs": "{\"2\": 42, \"5\": 21, \"6\": 17, \"13\": 7, \"11\": 9, \"39\": 2, \"10\": 10, \"22\": 4, \"23\": 4, \"54\": 1, \"20\": 5, \"55\": 1, \"24\": 4, \"25\": 4, \"56\": 1, \"40\": 2, \"57\": 1, \"7\": 16, \"3\": 35, \"41\": 2, \"42\": 2, \"58\": 1, \"14\": 7, \"8\": 16, \"26\": 4, \"33\": 3, \"59\": 1, \"60\": 1, \"61\": 1, \"15\": 7, \"4\": 25, \"9\": 12, \"27\": 4, \"16\": 7, \"18\": 6, \"62\": 1, \"34\": 3, \"28\": 4, \"29\": 4, \"63\": 1, \"43\": 2, \"64\": 1, \"21\": 5, \"17\": 7, \"12\": 9, \"44\": 2, \"19\": 6, \"45\": 2, \"65\": 1, \"46\": 2, \"66\": 1, \"67\": 1, \"68\": 1, \"35\": 3, \"30\": 4, \"47\": 2, \"31\": 3, \"69\": 1, \"70\": 1, \"36\": 3, \"37\": 3, \"38\": 3, \"71\": 1, \"72\": 1, \"32\": 4, \"73\": 1, \"74\": 1, \"48\": 2, \"49\": 2, \"75\": 1, \"76\": 1, \"77\": 1, \"78\": 1, \"79\": 1, \"50\": 2, \"80\": 1, \"82\": 1, \"81\": 1, \"83\": 1, \"51\": 2, \"84\": 1, \"52\": 2, \"53\": 2, \"85\": 1, \"86\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"events\", \"3\": \"week\", \"4\": \"event\", \"5\": \"today\", \"6\": \"what\", \"7\": \"this\", \"8\": \"next\", \"9\": \"about\", \"10\": \"for\", \"11\": \"me\", \"12\": \"location\", \"13\": \"show\", \"14\": \"the\", \"15\": \"details\", \"16\": \"of\", \"17\": \"where\", \"18\": \"info\", \"19\": \"place\", \"20\": \"happening\", \"21\": \"venue\", \"22\": \"schedule\", \"23\": \"on\", \"24\": \"is\", \"25\": \"activities\", \"26\": \"upcoming\", \"27\": \"tell\", \"28\": \"more\", \"29\": \"information\", \"30\": \"you\", \"31\": \"do\", \"32\": \"good\", \"33\": \"coming\", \"34\": \"describe\", \"35\": \"help\", \"36\": \"hello\", \"37\": \"hi\", \"38\": \"hey\", \"39\": \"any\", \"40\": \"now\", \"41\": \"weekly\", \"42\": \"in\", \"43\": \"description\", \"44\": \"find\", \"45\": \"address\", \"46\": \"it\", \"47\": \"can\", \"48\": \"assist\", \"49\": \"how\", \"50\": \"support\", \"51\": \"please\", \"52\": \"weeks\", \"53\": \"there\", \"54\": \"are\", \"55\": \"scheduled\", \"56\": \"right\", \"57\": \"current\", \"58\": \"days\", \"59\": \"future\", \"60\": \"following\", \"61\": \"planned\", \"62\": \"give\", \"63\": \"explain\", \"64\": \"full\", \"65\": \"will\", \"66\": \"be\", \"67\": \"does\", \"68\": \"take\", \"69\": \"don\", \"70\": \"understand\", \"71\": \"greetings\", \"72\": \"morning\", \"73\": \"afternoon\", \"74\": \"evening\", \"75\": \"commands\", \"76\": \"options\", \"77\": \"menu\", \"78\": \"start\", \"79\": \"begin\", \"80\": \"guide\", \"81\": \"to\", \"82\": \"use\", \"83\": \"instructions\", \"84\": \"todays\", \"85\": \"bot\", \"86\": \"day\"}", "word_index": "{\"<OOV>\": 1, \"events\": 2, \"week\": 3, \"event\": 4, \"today\": 5, \"what\": 6, \"this\": 7, \"next\": 8, \"about\": 9, \"for\": 10, \"me\": 11, \"location\": 12, \"show\": 13, \"the\": 14, \"details\": 15, \"of\": 16, \"where\": 17, \"info\": 18, \"place\": 19, \"happening\": 20, \"venue\": 21, \"schedule\": 22, \"on\": 23, \"is\": 24, \"activities\": 25, \"upcoming\": 26, \"tell\": 27, \"more\": 28, \"information\": 29, \"you\": 30, \"do\": 31, \"good\": 32, \"coming\": 33, \"describe\": 34, \"help\": 35, \"hello\": 36, \"hi\": 37, \"hey\": 38, \"any\": 39, \"now\": 40, \"weekly\": 41, \"in\": 42, \"description\": 43, \"find\": 44, \"address\": 45, \"it\": 46, \"can\": 47, \"assist\": 48, \"how\": 49, \"support\": 50, \"please\": 51, \"weeks\": 52, \"there\": 53, \"are\": 54, \"scheduled\": 55, \"right\": 56, \"current\": 57, \"days\": 58, \"future\": 59, \"following\": 60, \"planned\": 61, \"give\": 62, \"explain\": 63, \"full\": 64, \"will\": 65, \"be\": 66, \"does\": 67, \"take\": 68, \"don\": 69, \"understand\": 70, \"greetings\": 71, \"morning\": 72, \"afternoon\": 73, \"evening\": 74, \"commands\": 75, \"options\": 76, \"menu\": 77, \"start\": 78, \"begin\": 79, \"guide\": 80, \"to\": 81, \"use\": 82, \"instructions\": 83, \"todays\": 84, \"bot\": 85, \"day\": 86}"}}