{"class_name": "Tokenizer", "config": {"num_words": 500, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 320, "word_counts": "{\"hello\": 4, \"hi\": 4, \"hey\": 4, \"good\": 5, \"morning\": 2, \"afternoon\": 2, \"evening\": 2, \"greetings\": 1, \"there\": 8, \"day\": 2, \"howdy\": 1, \"sup\": 1, \"what\": 33, \"up\": 1, \"yo\": 1, \"hola\": 1, \"heya\": 1, \"bye\": 1, \"goodbye\": 1, \"see\": 3, \"you\": 10, \"later\": 4, \"ya\": 2, \"farewell\": 1, \"catch\": 1, \"talk\": 1, \"to\": 2, \"ttyl\": 1, \"take\": 2, \"care\": 1, \"peace\": 1, \"leaving\": 1, \"gotta\": 1, \"go\": 1, \"exit\": 1, \"quit\": 1, \"thank\": 1, \"thanks\": 1, \"thats\": 1, \"all\": 14, \"that\": 11, \"im\": 1, \"done\": 2, \"events\": 74, \"today\": 27, \"show\": 18, \"me\": 14, \"any\": 10, \"for\": 11, \"schedule\": 9, \"on\": 5, \"are\": 4, \"happening\": 9, \"scheduled\": 1, \"is\": 16, \"activities\": 4, \"right\": 1, \"now\": 2, \"current\": 1, \"whats\": 3, \"todays\": 2, \"event\": 58, \"do\": 5, \"we\": 1, \"have\": 1, \"tomorrow\": 14, \"tmrw\": 1, \"tmr\": 1, \"tomorrows\": 1, \"about\": 19, \"this\": 35, \"week\": 44, \"weekly\": 2, \"in\": 2, \"the\": 12, \"next\": 20, \"days\": 1, \"weeks\": 4, \"coming\": 3, \"following\": 2, \"planned\": 1, \"upcoming\": 10, \"list\": 15, \"complete\": 3, \"full\": 3, \"every\": 1, \"of\": 20, \"everything\": 2, \"available\": 4, \"entire\": 2, \"give\": 5, \"can\": 4, \"details\": 7, \"tell\": 7, \"info\": 7, \"describe\": 3, \"more\": 6, \"information\": 4, \"explain\": 1, \"description\": 2, \"detail\": 10, \"it\": 9, \"when\": 8, \"time\": 5, \"date\": 5, \"does\": 4, \"happen\": 3, \"venue\": 7, \"where\": 14, \"location\": 11, \"find\": 2, \"place\": 6, \"address\": 2, \"will\": 1, \"be\": 1, \"wheres\": 1, \"help\": 3, \"don\": 2, \"understand\": 1, \"assist\": 2, \"how\": 2, \"commands\": 1, \"options\": 1, \"menu\": 1, \"start\": 1, \"begin\": 1, \"support\": 2, \"guide\": 1, \"use\": 1, \"instructions\": 1, \"random\": 1, \"text\": 1, \"gibberish\": 1, \"huh\": 1, \"confused\": 1, \"get\": 1, \"makes\": 1, \"no\": 1, \"sense\": 1, \"unclear\": 1, \"sorry\": 1, \"pardon\": 1, \"repeat\": 1, \"again\": 1, \"idk\": 1, \"dunno\": 1, \"not\": 1, \"sure\": 1, \"please\": 2, \"display\": 1, \"bot\": 1}", "word_docs": "{\"hello\": 4, \"hi\": 4, \"hey\": 4, \"good\": 5, \"morning\": 2, \"afternoon\": 2, \"evening\": 2, \"greetings\": 1, \"there\": 8, \"day\": 2, \"howdy\": 1, \"sup\": 1, \"what\": 33, \"up\": 1, \"yo\": 1, \"hola\": 1, \"heya\": 1, \"bye\": 1, \"goodbye\": 1, \"you\": 10, \"see\": 3, \"later\": 4, \"ya\": 2, \"farewell\": 1, \"catch\": 1, \"to\": 2, \"talk\": 1, \"ttyl\": 1, \"take\": 2, \"care\": 1, \"peace\": 1, \"leaving\": 1, \"go\": 1, \"gotta\": 1, \"exit\": 1, \"quit\": 1, \"thank\": 1, \"thanks\": 1, \"all\": 14, \"thats\": 1, \"that\": 11, \"done\": 2, \"im\": 1, \"events\": 74, \"today\": 27, \"me\": 14, \"show\": 18, \"any\": 10, \"for\": 11, \"schedule\": 9, \"on\": 5, \"are\": 4, \"happening\": 9, \"scheduled\": 1, \"is\": 16, \"activities\": 4, \"right\": 1, \"now\": 2, \"current\": 1, \"whats\": 3, \"todays\": 2, \"event\": 58, \"have\": 1, \"do\": 4, \"we\": 1, \"tomorrow\": 14, \"tmrw\": 1, \"tmr\": 1, \"tomorrows\": 1, \"about\": 19, \"week\": 44, \"this\": 35, \"weekly\": 2, \"days\": 1, \"next\": 20, \"in\": 2, \"the\": 12, \"weeks\": 4, \"coming\": 3, \"following\": 2, \"planned\": 1, \"upcoming\": 10, \"list\": 15, \"complete\": 3, \"full\": 3, \"every\": 1, \"of\": 20, \"everything\": 2, \"available\": 4, \"entire\": 2, \"give\": 5, \"can\": 4, \"details\": 7, \"tell\": 7, \"info\": 7, \"describe\": 3, \"information\": 4, \"more\": 6, \"explain\": 1, \"description\": 2, \"detail\": 10, \"it\": 9, \"when\": 8, \"time\": 5, \"date\": 5, \"does\": 4, \"happen\": 3, \"venue\": 7, \"where\": 14, \"location\": 11, \"find\": 2, \"place\": 6, \"address\": 2, \"be\": 1, \"will\": 1, \"wheres\": 1, \"help\": 3, \"don\": 2, \"understand\": 1, \"assist\": 2, \"how\": 2, \"commands\": 1, \"options\": 1, \"menu\": 1, \"start\": 1, \"begin\": 1, \"support\": 2, \"guide\": 1, \"use\": 1, \"instructions\": 1, \"text\": 1, \"random\": 1, \"gibberish\": 1, \"huh\": 1, \"confused\": 1, \"get\": 1, \"no\": 1, \"makes\": 1, \"sense\": 1, \"unclear\": 1, \"sorry\": 1, \"pardon\": 1, \"repeat\": 1, \"again\": 1, \"idk\": 1, \"dunno\": 1, \"not\": 1, \"sure\": 1, \"please\": 2, \"display\": 1, \"bot\": 1}", "index_docs": "{\"43\": 4, \"44\": 4, \"45\": 4, \"37\": 5, \"62\": 2, \"63\": 2, \"64\": 2, \"85\": 1, \"29\": 8, \"65\": 2, \"86\": 1, \"87\": 1, \"6\": 33, \"88\": 1, \"89\": 1, \"90\": 1, \"91\": 1, \"92\": 1, \"93\": 1, \"22\": 10, \"54\": 3, \"46\": 4, \"66\": 2, \"94\": 1, \"95\": 1, \"67\": 2, \"96\": 1, \"97\": 1, \"68\": 2, \"98\": 1, \"99\": 1, \"100\": 1, \"102\": 1, \"101\": 1, \"103\": 1, \"104\": 1, \"105\": 1, \"106\": 1, \"14\": 14, \"107\": 1, \"19\": 11, \"69\": 2, \"108\": 1, \"2\": 74, \"7\": 27, \"15\": 14, \"11\": 18, \"23\": 10, \"20\": 11, \"26\": 9, \"38\": 5, \"47\": 4, \"27\": 9, \"109\": 1, \"12\": 16, \"48\": 4, \"110\": 1, \"70\": 2, \"111\": 1, \"55\": 3, \"71\": 2, \"3\": 58, \"113\": 1, \"39\": 4, \"112\": 1, \"16\": 14, \"114\": 1, \"115\": 1, \"116\": 1, \"10\": 19, \"4\": 44, \"5\": 35, \"72\": 2, \"117\": 1, \"8\": 20, \"73\": 2, \"18\": 12, \"49\": 4, \"56\": 3, \"74\": 2, \"118\": 1, \"24\": 10, \"13\": 15, \"57\": 3, \"58\": 3, \"119\": 1, \"9\": 20, \"75\": 2, \"50\": 4, \"76\": 2, \"40\": 5, \"51\": 4, \"31\": 7, \"32\": 7, \"33\": 7, \"59\": 3, \"52\": 4, \"35\": 6, \"120\": 1, \"77\": 2, \"25\": 10, \"28\": 9, \"30\": 8, \"41\": 5, \"42\": 5, \"53\": 4, \"60\": 3, \"34\": 7, \"17\": 14, \"21\": 11, \"78\": 2, \"36\": 6, \"79\": 2, \"122\": 1, \"121\": 1, \"123\": 1, \"61\": 3, \"80\": 2, \"124\": 1, \"81\": 2, \"82\": 2, \"125\": 1, \"126\": 1, \"127\": 1, \"128\": 1, \"129\": 1, \"83\": 2, \"130\": 1, \"131\": 1, \"132\": 1, \"134\": 1, \"133\": 1, \"135\": 1, \"136\": 1, \"137\": 1, \"138\": 1, \"140\": 1, \"139\": 1, \"141\": 1, \"142\": 1, \"143\": 1, \"144\": 1, \"145\": 1, \"146\": 1, \"147\": 1, \"148\": 1, \"149\": 1, \"150\": 1, \"84\": 2, \"151\": 1, \"152\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"events\", \"3\": \"event\", \"4\": \"week\", \"5\": \"this\", \"6\": \"what\", \"7\": \"today\", \"8\": \"next\", \"9\": \"of\", \"10\": \"about\", \"11\": \"show\", \"12\": \"is\", \"13\": \"list\", \"14\": \"all\", \"15\": \"me\", \"16\": \"tomorrow\", \"17\": \"where\", \"18\": \"the\", \"19\": \"that\", \"20\": \"for\", \"21\": \"location\", \"22\": \"you\", \"23\": \"any\", \"24\": \"upcoming\", \"25\": \"detail\", \"26\": \"schedule\", \"27\": \"happening\", \"28\": \"it\", \"29\": \"there\", \"30\": \"when\", \"31\": \"details\", \"32\": \"tell\", \"33\": \"info\", \"34\": \"venue\", \"35\": \"more\", \"36\": \"place\", \"37\": \"good\", \"38\": \"on\", \"39\": \"do\", \"40\": \"give\", \"41\": \"time\", \"42\": \"date\", \"43\": \"hello\", \"44\": \"hi\", \"45\": \"hey\", \"46\": \"later\", \"47\": \"are\", \"48\": \"activities\", \"49\": \"weeks\", \"50\": \"available\", \"51\": \"can\", \"52\": \"information\", \"53\": \"does\", \"54\": \"see\", \"55\": \"whats\", \"56\": \"coming\", \"57\": \"complete\", \"58\": \"full\", \"59\": \"describe\", \"60\": \"happen\", \"61\": \"help\", \"62\": \"morning\", \"63\": \"afternoon\", \"64\": \"evening\", \"65\": \"day\", \"66\": \"ya\", \"67\": \"to\", \"68\": \"take\", \"69\": \"done\", \"70\": \"now\", \"71\": \"todays\", \"72\": \"weekly\", \"73\": \"in\", \"74\": \"following\", \"75\": \"everything\", \"76\": \"entire\", \"77\": \"description\", \"78\": \"find\", \"79\": \"address\", \"80\": \"don\", \"81\": \"assist\", \"82\": \"how\", \"83\": \"support\", \"84\": \"please\", \"85\": \"greetings\", \"86\": \"howdy\", \"87\": \"sup\", \"88\": \"up\", \"89\": \"yo\", \"90\": \"hola\", \"91\": \"heya\", \"92\": \"bye\", \"93\": \"goodbye\", \"94\": \"farewell\", \"95\": \"catch\", \"96\": \"talk\", \"97\": \"ttyl\", \"98\": \"care\", \"99\": \"peace\", \"100\": \"leaving\", \"101\": \"gotta\", \"102\": \"go\", \"103\": \"exit\", \"104\": \"quit\", \"105\": \"thank\", \"106\": \"thanks\", \"107\": \"thats\", \"108\": \"im\", \"109\": \"scheduled\", \"110\": \"right\", \"111\": \"current\", \"112\": \"we\", \"113\": \"have\", \"114\": \"tmrw\", \"115\": \"tmr\", \"116\": \"tomorrows\", \"117\": \"days\", \"118\": \"planned\", \"119\": \"every\", \"120\": \"explain\", \"121\": \"will\", \"122\": \"be\", \"123\": \"wheres\", \"124\": \"understand\", \"125\": \"commands\", \"126\": \"options\", \"127\": \"menu\", \"128\": \"start\", \"129\": \"begin\", \"130\": \"guide\", \"131\": \"use\", \"132\": \"instructions\", \"133\": \"random\", \"134\": \"text\", \"135\": \"gibberish\", \"136\": \"huh\", \"137\": \"confused\", \"138\": \"get\", \"139\": \"makes\", \"140\": \"no\", \"141\": \"sense\", \"142\": \"unclear\", \"143\": \"sorry\", \"144\": \"pardon\", \"145\": \"repeat\", \"146\": \"again\", \"147\": \"idk\", \"148\": \"dunno\", \"149\": \"not\", \"150\": \"sure\", \"151\": \"display\", \"152\": \"bot\"}", "word_index": "{\"<OOV>\": 1, \"events\": 2, \"event\": 3, \"week\": 4, \"this\": 5, \"what\": 6, \"today\": 7, \"next\": 8, \"of\": 9, \"about\": 10, \"show\": 11, \"is\": 12, \"list\": 13, \"all\": 14, \"me\": 15, \"tomorrow\": 16, \"where\": 17, \"the\": 18, \"that\": 19, \"for\": 20, \"location\": 21, \"you\": 22, \"any\": 23, \"upcoming\": 24, \"detail\": 25, \"schedule\": 26, \"happening\": 27, \"it\": 28, \"there\": 29, \"when\": 30, \"details\": 31, \"tell\": 32, \"info\": 33, \"venue\": 34, \"more\": 35, \"place\": 36, \"good\": 37, \"on\": 38, \"do\": 39, \"give\": 40, \"time\": 41, \"date\": 42, \"hello\": 43, \"hi\": 44, \"hey\": 45, \"later\": 46, \"are\": 47, \"activities\": 48, \"weeks\": 49, \"available\": 50, \"can\": 51, \"information\": 52, \"does\": 53, \"see\": 54, \"whats\": 55, \"coming\": 56, \"complete\": 57, \"full\": 58, \"describe\": 59, \"happen\": 60, \"help\": 61, \"morning\": 62, \"afternoon\": 63, \"evening\": 64, \"day\": 65, \"ya\": 66, \"to\": 67, \"take\": 68, \"done\": 69, \"now\": 70, \"todays\": 71, \"weekly\": 72, \"in\": 73, \"following\": 74, \"everything\": 75, \"entire\": 76, \"description\": 77, \"find\": 78, \"address\": 79, \"don\": 80, \"assist\": 81, \"how\": 82, \"support\": 83, \"please\": 84, \"greetings\": 85, \"howdy\": 86, \"sup\": 87, \"up\": 88, \"yo\": 89, \"hola\": 90, \"heya\": 91, \"bye\": 92, \"goodbye\": 93, \"farewell\": 94, \"catch\": 95, \"talk\": 96, \"ttyl\": 97, \"care\": 98, \"peace\": 99, \"leaving\": 100, \"gotta\": 101, \"go\": 102, \"exit\": 103, \"quit\": 104, \"thank\": 105, \"thanks\": 106, \"thats\": 107, \"im\": 108, \"scheduled\": 109, \"right\": 110, \"current\": 111, \"we\": 112, \"have\": 113, \"tmrw\": 114, \"tmr\": 115, \"tomorrows\": 116, \"days\": 117, \"planned\": 118, \"every\": 119, \"explain\": 120, \"will\": 121, \"be\": 122, \"wheres\": 123, \"understand\": 124, \"commands\": 125, \"options\": 126, \"menu\": 127, \"start\": 128, \"begin\": 129, \"guide\": 130, \"use\": 131, \"instructions\": 132, \"random\": 133, \"text\": 134, \"gibberish\": 135, \"huh\": 136, \"confused\": 137, \"get\": 138, \"makes\": 139, \"no\": 140, \"sense\": 141, \"unclear\": 142, \"sorry\": 143, \"pardon\": 144, \"repeat\": 145, \"again\": 146, \"idk\": 147, \"dunno\": 148, \"not\": 149, \"sure\": 150, \"display\": 151, \"bot\": 152}"}}